{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_7", "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_7", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_8", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "name": "conv2d_9", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_9", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_5", "kernel_constraint": null, "units": 128, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_6", "kernel_constraint": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}}], "name": "sequential_3"}, "keras_version": "2.2.4"}